---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsElecCircuitType
source: html/def46e4a-a07d-b781-c3a9-2b774829781e.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsElecCircuitType Property

"System Type"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsElecCircuitType { get; }
```